// =====================================================================================================================
//Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
//452 -> 11
//82 -> 10
//9012 -> 12
Console.Clear();
Console.Write("Введите число: ");
int n = Math.Abs(Convert.ToInt32(Console.ReadLine()));
int res = 0;
while (n > 0)
{
    res += n % 10;
    n /= 10;
}
Console.WriteLine("Сумма цифр: " + res);