// =====================================================================================================================
//Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
//A (3,6,8); B (2,1,-7), -> 15.84
//A (7,-5, 0); B (1,-1,9) -> 11.53

Console.Clear();
int[] A = { 3, 6, 8 };
int[] B = { 2, 1, -7 };
// int[] A = { 7, -5, 0 };
// int[] B = { 1, -1, 9 };
int[] ab = new int[A.Length];
for (int i = 0; i < A.Length; i++)
{
    ab[i] = A[i] - B[i];
}
Console.WriteLine(Math.Sqrt(ab[0] * ab[0] + ab[1] * ab[1] + ab[2] * ab[2]));