// =====================================================================================================================
//Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. Вводит пользователь.
//1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19] 
//6, 1, 33 -> [6, 1, 33]
int[] a = new int[8];
// string str = "";
for (int i = 0; i < a.Length; i++)
{
   Console.Write("Введите элемент N{0}: ", i);
   a[i] = Convert.ToInt32(Console.ReadLine());
//    str += a[i].ToString() + " ";
}
// Console.Write("[{0}]", str);
Console.WriteLine($"[{string.Join(", ", a)}]");
